/* ===============================
   TIMELINE DATA
   =============================== */

const timelineData = [
    { 
        dateText: "12 ธ.ค. 68", 
        title: "พ.ร.ฎ.ยุบสภาฯ มีผลบังคับใช้", 
        desc: "พระราชกฤษฎีกายุบสภาผู้แทนราษฎร พ.ศ.2568 เริ่มมีผล", 
        startDate: new Date("2025-12-12T00:00:00"), 
        endDate: new Date("2025-12-12T23:59:59") 
    },
    { 
        dateText: "8 ก.พ. 69", 
        title: "⭐ วันเลือกตั้งและออกเสียงประชามติ ⭐", 
        desc: "(08.00-17.00 น.) โปรดเตรียมบัตรประชาชน", 
        startDate: new Date("2026-02-08T08:00:00"), 
        endDate: new Date("2026-02-08T17:00:00") 
    },
    { 
        dateText: "9-15 ก.พ. 69", 
        title: "แจ้งเหตุไม่อาจไปใช้สิทธิ์", 
        desc: "ระยะเวลา 7 วัน หลังวันเลือกตั้ง", 
        startDate: new Date("2026-02-09T00:00:00"), 
        endDate: new Date("2026-02-15T23:59:59") 
    }
];

/* ===============================
   UNIT DATA (ข้อมูลหน่วยเลือกตั้ง)
   =============================== */

const units = [
    { 
        id: "001", 
        name: "เต็นท์บริเวณลานจอดรถ ตลาดยาสูบ", 
        unit_count: "6 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 1-6", 
        lat: 13.724265, 
        lng: 100.554604 
    },
    { 
        id: "002", 
        name: "เต็นท์บริเวณท้ายสวนเบญจกิติ ท้ายซอยสุขุมวิท 4", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 7", 
        lat: 13.733863, 
        lng: 100.553219 
    },
    { 
        id: "003", 
        name: "เต็นท์บริเวณด้านหน้าสมาคมอนุเคราะห์คลองเตย", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 8", 
        lat: 13.72007, 
        lng: 100.5635792 
    }
];
