const timelineData = [
    { 
        dateText: "21 พ.ค. 69", 
        title: "วันที่ดำรงตำแหน่งครบวาระ", 
        desc: "(ม.11)", 
        startDate: new Date("2026-05-21T00:00:00"), 
        endDate: new Date("2026-05-21T23:59:59") 
    },
    { 
        dateText: "22 พ.ค. 69", 
        title: "เสนอและเห็นชอบร่างประกาศวันเลือกตั้ง", 
        desc: "ผอ.กต.ท้องถิ่น เสนอร่างวันเลือกตั้ง และ ผอ.กต.กทม. ให้ความเห็นชอบ", 
        startDate: new Date("2026-05-22T00:00:00"), 
        endDate: new Date("2026-05-22T23:59:59") 
    },
    { 
        dateText: "23 พ.ค. 69", 
        title: "ประกาศให้มีการเลือกตั้ง", 
        desc: "โดย ผอ.กต.ท้องถิ่น (ม.12)", 
        startDate: new Date("2026-05-23T00:00:00"), 
        endDate: new Date("2026-05-23T23:59:59") 
    },
    { 
        dateText: "28 พ.ค. - 1 มิ.ย. 69", 
        title: "วันรับสมัครรับเลือกตั้ง", 
        desc: "(ม.12)", 
        startDate: new Date("2026-05-28T00:00:00"), 
        endDate: new Date("2026-06-01T23:59:59") 
    },
    { 
        dateText: "2 มิ.ย. 69", 
        title: "วันสุดท้ายประกาศหน่วยเลือกตั้ง/บัญชีรายชื่อ", 
        desc: "ประกาศกำหนดหน่วยเลือกตั้ง/ที่เลือกตั้ง (ม.23) และ บัญชีรายชื่อผู้มีสิทธิเลือกตั้ง (ม.43)", 
        startDate: new Date("2026-06-02T00:00:00"), 
        endDate: new Date("2026-06-02T23:59:59") 
    },
    { 
        dateText: "7 มิ.ย. 69", 
        title: "วันสุดท้ายแต่งตั้งเจ้าพนักงานปฏิบัติหน้าที่", 
        desc: "(ม.28)", 
        startDate: new Date("2026-06-07T00:00:00"), 
        endDate: new Date("2026-06-07T23:59:59") 
    },
    { 
        dateText: "8 มิ.ย. 69", 
        title: "ประกาศรายชื่อผู้สมัคร", 
        desc: "(ม.52)", 
        startDate: new Date("2026-06-08T00:00:00"), 
        endDate: new Date("2026-06-08T23:59:59") 
    },
    { 
        dateText: "11 มิ.ย. 69", 
        title: "วันสุดท้ายยื่นคำร้องกรณีไม่รับสมัคร", 
        desc: "ยื่นคำร้องต่อ กกต. (ม.55)", 
        startDate: new Date("2026-06-11T00:00:00"), 
        endDate: new Date("2026-06-11T23:59:59") 
    },
    { 
        dateText: "12 มิ.ย. 69", 
        title: "วันสุดท้ายส่งหนังสือแจ้งเจ้าบ้าน", 
        desc: "(ม.43)", 
        startDate: new Date("2026-06-12T00:00:00"), 
        endDate: new Date("2026-06-12T23:59:59") 
    },
    { 
        dateText: "17 มิ.ย. 69", 
        title: "วันสุดท้ายเปลี่ยนแปลงหน่วยเลือกตั้ง และเพิ่ม-ถอนชื่อ", 
        desc: "(ม.23, ม.44, ม.45)", 
        startDate: new Date("2026-06-17T00:00:00"), 
        endDate: new Date("2026-06-17T23:59:59") 
    },
    { 
        dateText: "20 มิ.ย. 69", 
        title: "วันสุดท้ายแจ้งการแต่งตั้งตัวแทนผู้สมัคร", 
        desc: "(ม.58)", 
        startDate: new Date("2026-06-20T00:00:00"), 
        endDate: new Date("2026-06-20T23:59:59") 
    },
    { 
        dateText: "21 - 27 มิ.ย. 69", 
        title: "แจ้งเหตุที่ไม่อาจไปใช้สิทธิเลือกตั้ง (รอบก่อนเลือกตั้ง)", 
        desc: "(ม.40)", 
        startDate: new Date("2026-06-21T00:00:00"), 
        endDate: new Date("2026-06-27T23:59:59") 
    },
    { 
        dateText: "27 มิ.ย. 69", 
        title: "วันสุดท้ายศาลอุทธรณ์วินิจฉัยสิทธิสมัคร และอบรมเจ้าพนักงาน", 
        desc: "อบรมเจ้าพนักงานผู้ดำเนินการเลือกตั้ง/มอบวัสดุอุปกรณ์ (ม.56)", 
        startDate: new Date("2026-06-27T00:00:00"), 
        endDate: new Date("2026-06-27T23:59:59") 
    },
    { 
        dateText: "28 มิ.ย. 69", 
        title: "⭐ วันเลือกตั้ง ⭐", 
        desc: "(08.00-17.00 น.) โปรดเตรียมบัตรประชาชน", 
        startDate: new Date("2026-06-28T08:00:00"), 
        endDate: new Date("2026-06-28T17:00:00") 
    },
    { 
        dateText: "29 มิ.ย. - 5 ก.ค. 69", 
        title: "แจ้งเหตุที่ไม่อาจไปใช้สิทธิเลือกตั้ง (รอบหลังเลือกตั้ง)", 
        desc: "(ม.40)", 
        startDate: new Date("2026-06-29T00:00:00"), 
        endDate: new Date("2026-07-05T23:59:59") 
    },
    { 
        dateText: "28 ก.ค. 69", 
        title: "วันสุดท้ายประกาศผลการเลือกตั้ง (วรรคหนึ่ง)", 
        desc: "ตามมาตรา 17 วรรคหนึ่ง", 
        startDate: new Date("2026-07-28T00:00:00"), 
        endDate: new Date("2026-07-28T23:59:59") 
    },
    { 
        dateText: "27 ส.ค. 69", 
        title: "วันสุดท้ายประกาศผลการเลือกตั้ง (วรรคสอง)", 
        desc: "รวมถึงวันสุดท้ายประกาศรายชื่อผู้ถูกจำกัดสิทธิ (ม.17 วรรคสอง, ม.41)", 
        startDate: new Date("2026-08-27T00:00:00"), 
        endDate: new Date("2026-08-27T23:59:59") 
    }
];
/* ===============================
   UNIT DATA (ข้อมูลหน่วยเลือกตั้ง)
   =============================== */
const units = [
    // ------------------- แขวงคลองเตย -------------------
    { 
        id: "001", 
        name: "เต็นท์บริเวณลานจอดรถตลาดยาสูบ", 
        unit_count: "5 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 1-5", 
        lat: 13.723846660011422,
        lng: 100.55506260381345
    },
    { 
        id: "002", 
        name: "เต็นท์บริเวณชุมชนอาคารทรัพย์สิน 26-7", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 6", 
        lat: 13.721975306250442,
        lng: 100.56100416488671
    },
    { 
        id: "003", 
        name: "เต็นท์บริเวณโรงแรมนานาใต้สวีท ท้ายซอยสุขุมวิท 4", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 7", 
        lat: 13.73444402754088,
        lng: 100.55339562870259 
    },
    { 
        id: "004", 
        name: "เต็นท์บริเวณลานจอดรถ เอสเอ็น อพาร์ทเม้นท์ ซอยไผ่สิงห์โต", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 8-9", 
        lat: 13.721089596765074,
        lng: 100.56135208898337
    },
    { 
        id: "005", 
        name: "เต็นท์บริเวณลานจอดรถอาคารไอสโตร์ ซอยสุขุมวิท 24", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 10-12", 
        lat: 13.72379347547501,
        lng: 100.56760228365164 
    },
    { 
        id: "006", 
        name: "เต็นท์บริเวณลานเทนธ์ อเวนิว (สวนชูวิทย์) ปากซอยสุขุมวิท 10", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 13-14", 
        lat: 13.739131566873247,
        lng: 100.55730282228669
    },
    { 
        id: "007", 
        name: "โรงจอดรถอาคารชุดซิตี้เลคทาวเวอร์ ซอยสุขุมวิท 16", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 15", 
        lat: 13.733667957086263,
        lng: 100.56105997524976
    },
    { 
        id: "008", 
        name: "เต็นท์บริเวณลานกิจกรรมโรงเรียนสายน้ำผึ้ง", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 16-18", 
        lat: 13.72754577068108,
        lng: 100.56508841098866
    },
    { 
        id: "009", 
        name: "เต็นท์บริเวณที่จอดรถหน้าศูนย์อาหาร 130 ปี กรมศุลกากร", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 19-21", 
        lat: 13.712893661920617,
        lng: 100.56516618763642 
    },
    { 
        id: "010", 
        name: "บริเวณที่จอดรถข้างอาคาร 2 ศูนย์บริการสาธารณสุข 41 คลองเตย", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 22", 
        lat: 13.714872232017038,
        lng: 100.5697366927056 
    },
    { 
        id: "011", 
        name: "อาคารที่พักผู้ปกครองหน้าโรงเรียนพระหฤทัยคอนแวนต์", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 23-25", 
        lat: 13.717986709367405,
        lng: 100.5579461462495 
    },
    { 
        id: "012", 
        name: "เต็นท์บริเวณสวนสมเด็จย่า ถนนพระราม 3", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 26-27", 
        lat: 13.715463569070756, 
        lng: 100.55560881351164
    },
    { 
        id: "013", 
        name: "บริเวณด้านหลังอาคารสโมสรการท่าเรือ", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 28", 
        lat: 13.716139547989725,
        lng: 100.5596302553571
    },
    { 
        id: "014", 
        name: "โรงเรียนไทยประสิทธิ์ศาสตร์ วัดคลองเตยนอก", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 29", 
        lat: 13.707903965680831, 
        lng: 100.56376181378546
    },
    { 
        id: "015", 
        name: "เต็นท์บริเวณโดมลานกีฬาชุมชนโรงหมู", 
        unit_count: "6 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 30-35", 
        lat: 13.7068525218971,
        lng: 100.5830541100846
    },
    { 
        id: "016", 
        name: "โรงเรียนศูนย์รวมน้ำใจ", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 36-38", 
        lat: 13.713208464319955,
        lng: 100.57025472109396
    },
    { 
        id: "017", 
        name: "เต็นท์บริเวณลานกีฬาฯ ระหว่างอาคารแฟลต 2 และอาคารแฟลต 3", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 39-40", 
        lat: 13.713940424557034,
        lng: 100.56987890256481
    },
    { 
        id: "018", 
        name: "เต็นท์บริเวณลานกีฬาฯ ระหว่างอาคารแฟลต 6 และอาคารแฟลต 7", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 41-43", 
        lat: 13.713794257831628,
        lng: 100.57102395321571
    },
    { 
        id: "019", 
        name: "ชั้นล่างอาคารแฟลต 9", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 44", 
        lat: 13.713262725897941,
        lng: 100.57141291224045
    },
    { 
        id: "020", 
        name: "เต็นท์บริเวณลานกีฬาชุมชนล็อค 4 - 5 - 6", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 45-47", 
        lat: 13.71054963095997,
        lng: 100.57628293164994
    },
    { 
        id: "021", 
        name: "โรงเรียนชุมชนหมู่บ้านพัฒนา", 
        unit_count: "4 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 48-51", 
        lat: 13.711080618280883,
        lng: 100.57512768031732
    },
    { 
        id: "022", 
        name: "อาคารศูนย์ส่งเสริมการพัฒนาบุคคล", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 52", 
        lat: 13.710078663673194,
        lng: 100.57597495615676
    },
    { 
        id: "023", 
        name: "เต็นท์บริเวณลานกีฬาศูนย์เยาวชนคลองเตย", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 53-55", 
        lat: 13.711262982830927,
        lng: 100.56881450938647
    },
    { 
        id: "024", 
        name: "เต็นท์บริเวณลานกีฬา กทม. ชุมชนแฟลต 11-18", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 56-57", 
        lat: 13.710208611362896,
        lng: 100.56922481018297
    },
    { 
        id: "025", 
        name: "เต็นท์บริเวณลานกีฬา กทม. ชุมชนพัฒนาชุมชนใหม่ แฟลต 19-22", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 58-59", 
        lat: 13.71072215064339,
        lng: 100.57238707385733
    },
    { 
        id: "026", 
        name: "เต็นท์บริเวณลานกีฬา กทม. ชุมชนหมู่บ้านพัฒนา 70 ไร่", 
        unit_count: "4 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 60-63", 
        lat: 13.708931365954045,
        lng: 100.57509278635389
    },
    { 
        id: "027", 
        name: "เต็นท์ลานกีฬา กทม. ชุมชนริมทางรถไฟสายท่าเรือ", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 64-65", 
        lat: 13.720000, 
        lng: 100.560000 
    },
    { 
        id: "028", 
        name: "โรงเรียนวัดคลองเตย", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 66-68", 
        lat: 13.710132043032893,
        lng: 100.56110982363057
    },

    // ------------------- แขวงคลองตัน -------------------
    { 
        id: "029", 
        name: "เต็นท์บริเวณโรงเรียนสายน้ำทิพย์", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองตัน หน่วยที่ 1", 
        lat: 13.730000, 
        lng: 100.565000 
    },
    { 
        id: "030", 
        name: "เต็นท์บริเวณอุทยานเบญจสิริ", 
        unit_count: "3 หน่วย", 
        details_range: "แขวงคลองตัน หน่วยที่ 2-4", 
        lat: 13.730000, 
        lng: 100.565000 
    },
    { 
        id: "031", 
        name: "เต็นท์บริเวณลานกิจกรรมหน้าห้างโลตัส พระราม 4", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงคลองตัน หน่วยที่ 5-6", 
        lat: 13.730000, 
        lng: 100.565000 
    },
    { 
        id: "032", 
        name: "เต็นท์บริเวณบิ๊กซี พระราม 4", 
        unit_count: "5 หน่วย", 
        details_range: "แขวงคลองตัน หน่วยที่ 7-11", 
        lat: 13.730000, 
        lng: 100.565000 
    },

    // ------------------- แขวงพระโขนง -------------------
    { 
        id: "033", 
        name: "เต็นท์บริเวณลานกิจกรรมโรงเรียนปทุมคงคา", 
        unit_count: "6 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 1-6", 
        lat: 13.715000, 
        lng: 100.585000 
    },
    { 
        id: "034", 
        name: "เต็นท์บริเวณสมาคมสกุลคู ถนนพระรามที่ 4", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 7-8", 
        lat: 13.715000, 
        lng: 100.585000 
    },
    { 
        id: "035", 
        name: "เต็นท์บริเวณลานจอดรถด้านหลังเซเว่นอีเลฟเว่นอาจณรงค์มาร์เก็ต", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 9-10", 
        lat: 13.715000, 
        lng: 100.585000 
    },
    { 
        id: "036", 
        name: "บริเวณลานจอดรถบริษัทท็อปไลน์มิวสิค", 
        unit_count: "5 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 11-15", 
        lat: 13.715000, 
        lng: 100.585000 
    },
    { 
        id: "037", 
        name: "เต็นท์บริเวณภายในวัดสะพาน", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 16-17", 
        lat: 13.715000, 
        lng: 100.585000 
    },
    { 
        id: "038", 
        name: "โรงเรียนวัดสะพาน", 
        unit_count: "2 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 18-19", 
        lat: 13.715000, 
        lng: 100.585000 
    },
    { 
        id: "039", 
        name: "บริเวณโรงอาหารการประปานครหลวง สาขาพระโขนง", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 20", 
        lat: 13.715000, 
        lng: 100.585000 
    },
    { 
        id: "040", 
        name: "บริเวณโรงจอดรถสถานีสูบน้ำพระโขนง", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 21", 
        lat: 13.715000, 
        lng: 100.585000 
    },
    { 
        id: "041", 
        name: "เต็นท์บริเวณลานจอดรถโลตัส สุขุมวิท 50", 
        unit_count: "5 หน่วย", 
        details_range: "แขวงพระโขนง หน่วยที่ 22-26", 
        lat: 13.715000, 
        lng: 100.585000 
    }
];
