const timelineData = [
    { 
        dateText: "21 พ.ค. 69", 
        title: "วันที่ดำรงตำแหน่งครบวาระ", 
        desc: "(ม.11)", 
        startDate: new Date("2026-05-21T00:00:00"), 
        endDate: new Date("2026-05-21T23:59:59") 
    },
    { 
        dateText: "22 พ.ค. 69", 
        title: "เสนอและเห็นชอบร่างประกาศวันเลือกตั้ง", 
        desc: "ผอ.กต.ท้องถิ่น เสนอร่างวันเลือกตั้ง และ ผอ.กต.กทม. ให้ความเห็นชอบ", 
        startDate: new Date("2026-05-22T00:00:00"), 
        endDate: new Date("2026-05-22T23:59:59") 
    },
    { 
        dateText: "23 พ.ค. 69", 
        title: "ประกาศให้มีการเลือกตั้ง", 
        desc: "โดย ผอ.กต.ท้องถิ่น (ม.12)", 
        startDate: new Date("2026-05-23T00:00:00"), 
        endDate: new Date("2026-05-23T23:59:59") 
    },
    { 
        dateText: "28 พ.ค. - 1 มิ.ย. 69", 
        title: "วันรับสมัครรับเลือกตั้ง", 
        desc: "(ม.12)", 
        startDate: new Date("2026-05-28T00:00:00"), 
        endDate: new Date("2026-06-01T23:59:59") 
    },
    { 
        dateText: "2 มิ.ย. 69", 
        title: "วันสุดท้ายประกาศหน่วยเลือกตั้ง/บัญชีรายชื่อ", 
        desc: "ประกาศกำหนดหน่วยเลือกตั้ง/ที่เลือกตั้ง (ม.23) และ บัญชีรายชื่อผู้มีสิทธิเลือกตั้ง (ม.43)", 
        startDate: new Date("2026-06-02T00:00:00"), 
        endDate: new Date("2026-06-02T23:59:59") 
    },
    { 
        dateText: "7 มิ.ย. 69", 
        title: "วันสุดท้ายแต่งตั้งเจ้าพนักงานปฏิบัติหน้าที่", 
        desc: "(ม.28)", 
        startDate: new Date("2026-06-07T00:00:00"), 
        endDate: new Date("2026-06-07T23:59:59") 
    },
    { 
        dateText: "8 มิ.ย. 69", 
        title: "ประกาศรายชื่อผู้สมัคร", 
        desc: "(ม.52)", 
        startDate: new Date("2026-06-08T00:00:00"), 
        endDate: new Date("2026-06-08T23:59:59") 
    },
    { 
        dateText: "11 มิ.ย. 69", 
        title: "วันสุดท้ายยื่นคำร้องกรณีไม่รับสมัคร", 
        desc: "ยื่นคำร้องต่อ กกต. (ม.55)", 
        startDate: new Date("2026-06-11T00:00:00"), 
        endDate: new Date("2026-06-11T23:59:59") 
    },
    { 
        dateText: "12 มิ.ย. 69", 
        title: "วันสุดท้ายส่งหนังสือแจ้งเจ้าบ้าน", 
        desc: "(ม.43)", 
        startDate: new Date("2026-06-12T00:00:00"), 
        endDate: new Date("2026-06-12T23:59:59") 
    },
    { 
        dateText: "17 มิ.ย. 69", 
        title: "วันสุดท้ายเปลี่ยนแปลงหน่วยเลือกตั้ง และเพิ่ม-ถอนชื่อ", 
        desc: "(ม.23, ม.44, ม.45)", 
        startDate: new Date("2026-06-17T00:00:00"), 
        endDate: new Date("2026-06-17T23:59:59") 
    },
    { 
        dateText: "20 มิ.ย. 69", 
        title: "วันสุดท้ายแจ้งการแต่งตั้งตัวแทนผู้สมัคร", 
        desc: "(ม.58)", 
        startDate: new Date("2026-06-20T00:00:00"), 
        endDate: new Date("2026-06-20T23:59:59") 
    },
    { 
        dateText: "21 - 27 มิ.ย. 69", 
        title: "แจ้งเหตุที่ไม่อาจไปใช้สิทธิเลือกตั้ง (รอบก่อนเลือกตั้ง)", 
        desc: "(ม.40)", 
        startDate: new Date("2026-06-21T00:00:00"), 
        endDate: new Date("2026-06-27T23:59:59") 
    },
    { 
        dateText: "27 มิ.ย. 69", 
        title: "วันสุดท้ายศาลอุทธรณ์วินิจฉัยสิทธิสมัคร และอบรมเจ้าพนักงาน", 
        desc: "อบรมเจ้าพนักงานผู้ดำเนินการเลือกตั้ง/มอบวัสดุอุปกรณ์ (ม.56)", 
        startDate: new Date("2026-06-27T00:00:00"), 
        endDate: new Date("2026-06-27T23:59:59") 
    },
    { 
        dateText: "28 มิ.ย. 69", 
        title: "⭐ วันเลือกตั้ง ⭐", 
        desc: "(08.00-17.00 น.) โปรดเตรียมบัตรประชาชน", 
        startDate: new Date("2026-06-28T08:00:00"), 
        endDate: new Date("2026-06-28T17:00:00") 
    },
    { 
        dateText: "29 มิ.ย. - 5 ก.ค. 69", 
        title: "แจ้งเหตุที่ไม่อาจไปใช้สิทธิเลือกตั้ง (รอบหลังเลือกตั้ง)", 
        desc: "(ม.40)", 
        startDate: new Date("2026-06-29T00:00:00"), 
        endDate: new Date("2026-07-05T23:59:59") 
    },
    { 
        dateText: "28 ก.ค. 69", 
        title: "วันสุดท้ายประกาศผลการเลือกตั้ง (วรรคหนึ่ง)", 
        desc: "ตามมาตรา 17 วรรคหนึ่ง", 
        startDate: new Date("2026-07-28T00:00:00"), 
        endDate: new Date("2026-07-28T23:59:59") 
    },
    { 
        dateText: "27 ส.ค. 69", 
        title: "วันสุดท้ายประกาศผลการเลือกตั้ง (วรรคสอง)", 
        desc: "รวมถึงวันสุดท้ายประกาศรายชื่อผู้ถูกจำกัดสิทธิ (ม.17 วรรคสอง, ม.41)", 
        startDate: new Date("2026-08-27T00:00:00"), 
        endDate: new Date("2026-08-27T23:59:59") 
    }
];
/* ===============================
   UNIT DATA (ข้อมูลหน่วยเลือกตั้ง)
   =============================== */

const units = [
    { 
        id: "001", 
        name: "เต็นท์บริเวณลานจอดรถ ตลาดยาสูบ", 
        unit_count: "6 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 1-6", 
        lat: 13.724265, 
        lng: 100.554604 
    },
    { 
        id: "002", 
        name: "เต็นท์บริเวณท้ายสวนเบญจกิติ ท้ายซอยสุขุมวิท 4", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 7", 
        lat: 13.733863, 
        lng: 100.553219 
    },
    { 
        id: "003", 
        name: "เต็นท์บริเวณด้านหน้าสมาคมอนุเคราะห์คลองเตย", 
        unit_count: "1 หน่วย", 
        details_range: "แขวงคลองเตย หน่วยที่ 8", 
        lat: 13.72007, 
        lng: 100.5635792 
    }
];
